{"Authors/Cary-Cooper":{"title":"Cary Cooper","links":["Book-Summary/📚-How-to-deal-with-Stress"],"tags":[],"content":"📚 How to deal with Stress"},"Authors/Stephen-Palmer":{"title":"Stephen Palmer","links":["Book-Summary/📚-How-to-deal-with-Stress"],"tags":[],"content":"📚 How to deal with Stress"},"Book-Summary/📚-How-to-deal-with-Stress":{"title":"📚 How to deal with Stress","links":["Wellness","Psychology","Authors/Stephen-Palmer","Authors/Cary-Cooper","covers/deal-with-stress.jpg"],"tags":[],"content":"\nTags: Wellness\nGenre: Psychology\nAuthors: Stephen Palmer, Cary Cooper\n\n\n\nShort summary\nWith right amount of pressure, we perform at the optimal level to achieve what we want. It is important to be mindful about not stressed while it is quite easy for a person with higher drive and too ambitious and high self-esteem. With correct techniques such as changing the way we think, applying mental imagery and changing our typical behavior and having SMART goals, we can alleviate our stress. Proper social connection, regular exercise, good time management and regularly leave time and space to relax are vital for healthy and stress free life\nNotes\nStress: Excessive pressure than what one is capable of coping with a given situation.\nWith the right amount of pressure, we function in an optimal way.\nWhen the pressure is less, we become\n\nUnderloaded\nFrustrated\nBored\nApathetic\nDepressed\nRustout\n\nWhen the pressure is more, we become\n\nOverloaded\nIrritable\nAnxious\nFatigued\nExhausted\nBurnout\n\n\nWe work best when stressed optimally\nLong term stress can lead to various physical and mental health conditions and needs to be addressed.\nHaving an internal locus of control is best. Having a proactive approach rather than responding to external factors, triggers.\n\nStress Model\nThe stress model is broken down into 6 stages\n\nExternal pressure or life events\nPerceived as stressful\nStress response: Physiological, behavioral &amp; psychological\nReappraisal of situation\nStress responses failing to remove stress causing factor\nPhysical and / or psychological illness\n\nOur negative perceptions, appraisals of a situation, not the situation itself may induce stress response.\nNegative emotions can be helpful to manage a stressful situation and we should watch out for unhelpful emotions for different scenarios and choose the helpful emotions.\n\nThreat or danger: Instead of feeling anxiety, helpful to feel concerned\n\nUnhelpful emotion: Anxiety\nHelpful emotion: Concern\n\n\nLoss, failure: Instead of feeling depressed, helpful to feel sadness\n\nUnhelpful emotion: Depression\nHelpful emotion: Sadness\n\n\nBreaking of moral code: Instead of feeling guilt, helpful to feel remorse\n\nUnhelpful emotion: Guilt\nHelpful emotion: Remorse\n\n\nBreaking of personal rule: Instead of feeling damning anger, helpful to feel non-damning anger\n\nUnhelpful emotion: Damning anger\nHelpful emotion: Non-damning anger\n\n\nPersonal weakness revealed publicly: Instead of feeling shame, helpful to feel regret\n\nUnhelpful emotion: Shame\nHelpful emotion: Regret\n\n\nOthers betraying you: Instead of feeling hurt, helpful to feel disappointment\n\nUnhelpful emotion: Hurt\nHelpful emotion: Disappointment\n\n\n\nChanging thinking\n\nPeople are disturbed not by things, but the view they take of them\n\nEpictetus\n\n\n\nThere is nothing good or bad, but thinking makes it so\n\nShakespear  -\n\n\n\nRefuse its assessment, all is well. Everything is what your opinion makes it; and that opinion lies within yourself. Renounce it when you will. and once you have rounded the foreland and all is calm: a tranquil sea, a tideless haven\n\nMarcus Aurelius\n\n\nABC of Stress\n\nA : Activating event or situation\nB: Beliefs about the event\nC: Consequences (emotional, behavioral, psychological)\n\nThere are several Stress Inducing Beliefs Indicator. They are thinking errors and there are 15 of them.\n\nAll-or-nothing thinking\nLabelling\nFocusing on the negative\nDiscounting the positive\nMind-reading\nFortune-telling\nMagnification or ‘awfulising’\nMinimisation\nEmotional reasoning\nBlame\nOvergeneralisation\n’Personalisation&#039;\n&#039;Demanding-ness’\nPhoney-ism\n’I-can’t-stand-it-itis\n\nBy applying correct thinking, stress can be handled better.\nThe following are thinking skills to help with this\n\nRelative thinking: avoid extreme thinking and have middle ground\nBefriending ourselves\nDe-labelling\n\nABCDE of Stress\n\nD: Disputation of the beliefs at B\nE: Effective new approach to deal with A\n\nABCDEF of stress\n\nF: Focus\n\nWhat we have learnt using E for applying for future\nCreating a Stress Thought Record (SIT vs SAT) helps getting perspective\nStress Inducing Thoughts VS Stress Alleviating Thoughts\nThe concept of Self acceptance is more robust than the concept of Self esteem.\nSelf acceptance is more realistic, logical and pragmatic.\nChanging Imagery\nCoping imagery helps to handle the stress.\nImagine how you will be handling the stressful situation in a positive way instead of assuming the worst scenario\nMotivation imagery can help to be and stay motivated\nRegular practice makes it easier to use imagery techniques and methods\nChanging behavior\n4 effective behavioral changes are\n\nType A behavior\n\nModify behaviors that trigger stress\napply cognitive, imagery and behavioral techniques such as\n\nmodify internal demands\nrelaxation\ntime management\n\n\n\n\nSocial support\n\nHave a support group of friends, family, co workers\ncommunicate\n\n\nBeing assertive\n\nBeing able to ask what you want\nstanding up for yourself\ncomplain appropriately\ndefend yourself\ngive constructive feedback to others when necessary.\n\n\nTime management\n\nPlan, but spend only appropriate time planning\navoid procrastinating\none task at a time\nallow time for unexpected\navoid automatically saying yes\n\n\n\nDevelop goals that are SMART\n\nS: Specific\nM: Measurable\nA: Achievable\nR: Realistic\nT: Time bound\n\nImprove physical health\n\nAlcohol\nSmoking\nCaffeine\nExercise\nNutrition\nRelaxation\n\nAction plan\n\nTalk more with friends and family\nDon’t beat yourself up\nChange the behavior that are Type A\nPractice mental imagery\nPlan realistically\nManage time\nDo these regularly\n\nExercise\nRelax\nMeditate regularly\n\n\n"},"Psychology":{"title":"Psychology","links":[],"tags":[],"content":""},"Wellness":{"title":"Wellness","links":[],"tags":[],"content":""},"index":{"title":"Welcome to the Suraikai","links":[],"tags":[],"content":"What is it?\nReading log, book summaries, and other things."}}